In [1]:
import pandas as pd
import numpy as np

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan,
'avocado'])

In [3]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data[0] = None#python内置的None值在对象数组中也可以作为NA
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [7]:
string_data.dropna()

1    artichoke
3      avocado
dtype: object

In [8]:
string_data.fillna(0)

0            0
1    artichoke
2            0
3      avocado
dtype: object

In [10]:
string_data.notnull()

0    False
1     True
2    False
3     True
dtype: bool

In [11]:
from numpy import nan as NA

In [12]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [13]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [14]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [15]:
data.dropna() is data[data.notnull()]

False

In [16]:
data.dropna() == data[data.notnull()]

0    True
2    True
4    True
dtype: bool

In [17]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])

In [18]:
cleaned = data.dropna()

In [19]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [20]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [21]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [22]:
data[4] = NA

In [23]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [24]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [25]:
df = pd.DataFrame(np.random.randn(7,3))

In [26]:
df.iloc[:4, 1] = NA

In [27]:
df.iloc[:2, 2] = NA

In [28]:
df

          0         1         2
0  0.764444       NaN       NaN
1  0.525595       NaN       NaN
2  1.537598       NaN -1.180648
3 -0.562011       NaN  0.051528
4 -1.477649 -0.157232 -1.240215
5  0.016222  1.431511 -0.844708
6 -0.915273 -0.473281  0.936054

In [29]:
df.dropna()

          0         1         2
4 -1.477649 -0.157232 -1.240215
5  0.016222  1.431511 -0.844708
6 -0.915273 -0.473281  0.936054

In [30]:
df.dropna(thresh=2)#thresh代表最少有几行是有效的数据

          0         1         2
2  1.537598       NaN -1.180648
3 -0.562011       NaN  0.051528
4 -1.477649 -0.157232 -1.240215
5  0.016222  1.431511 -0.844708
6 -0.915273 -0.473281  0.936054

In [31]:
df.dropna(thresh=1)

          0         1         2
0  0.764444       NaN       NaN
1  0.525595       NaN       NaN
2  1.537598       NaN -1.180648
3 -0.562011       NaN  0.051528
4 -1.477649 -0.157232 -1.240215
5  0.016222  1.431511 -0.844708
6 -0.915273 -0.473281  0.936054

In [32]:
df.dropna(thresh=3)

          0         1         2
4 -1.477649 -0.157232 -1.240215
5  0.016222  1.431511 -0.844708
6 -0.915273 -0.473281  0.936054

In [33]:
df.fillna(1)

          0         1         2
0  0.764444  1.000000  1.000000
1  0.525595  1.000000  1.000000
2  1.537598  1.000000 -1.180648
3 -0.562011  1.000000  0.051528
4 -1.477649 -0.157232 -1.240215
5  0.016222  1.431511 -0.844708
6 -0.915273 -0.473281  0.936054

In [34]:
df.fillna(0)

          0         1         2
0  0.764444  0.000000  0.000000
1  0.525595  0.000000  0.000000
2  1.537598  0.000000 -1.180648
3 -0.562011  0.000000  0.051528
4 -1.477649 -0.157232 -1.240215
5  0.016222  1.431511 -0.844708
6 -0.915273 -0.473281  0.936054

In [35]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  0.764444  0.500000  0.000000
1  0.525595  0.500000  0.000000
2  1.537598  0.500000 -1.180648
3 -0.562011  0.500000  0.051528
4 -1.477649 -0.157232 -1.240215
5  0.016222  1.431511 -0.844708
6 -0.915273 -0.473281  0.936054

In [36]:
df.fillna({1: 0.5})#通过字典的方式对指定列进行填充

          0         1         2
0  0.764444  0.500000       NaN
1  0.525595  0.500000       NaN
2  1.537598  0.500000 -1.180648
3 -0.562011  0.500000  0.051528
4 -1.477649 -0.157232 -1.240215
5  0.016222  1.431511 -0.844708
6 -0.915273 -0.473281  0.936054

In [37]:
_ = df.fillna(0, inplace=True)

In [38]:
df

          0         1         2
0  0.764444  0.000000  0.000000
1  0.525595  0.000000  0.000000
2  1.537598  0.000000 -1.180648
3 -0.562011  0.000000  0.051528
4 -1.477649 -0.157232 -1.240215
5  0.016222  1.431511 -0.844708
6 -0.915273 -0.473281  0.936054

In [42]:
df.fillna(1, inplace=True)

In [43]:
df

          0         1         2
0  0.764444  0.000000  0.000000
1  0.525595  0.000000  0.000000
2  1.537598  0.000000 -1.180648
3 -0.562011  0.000000  0.051528
4 -1.477649 -0.157232 -1.240215
5  0.016222  1.431511 -0.844708
6 -0.915273 -0.473281  0.936054

In [44]:
df1 = pd.DataFrame(np.random.randn(7,3))
df1.iloc[:4, 1] = NA
df1.iloc[:2, 2] = NA
df1

          0         1         2
0 -1.441279       NaN       NaN
1  1.325898       NaN       NaN
2  1.548097       NaN -0.251770
3  0.678044       NaN  0.494710
4  1.476794  0.003252  0.934820
5 -1.293636 -0.215698 -0.678130
6 -0.525464  1.810132 -1.221429

In [45]:
df1.fillna(1, inplace=True)

In [46]:
df1

          0         1         2
0 -1.441279  1.000000  1.000000
1  1.325898  1.000000  1.000000
2  1.548097  1.000000 -0.251770
3  0.678044  1.000000  0.494710
4  1.476794  0.003252  0.934820
5 -1.293636 -0.215698 -0.678130
6 -0.525464  1.810132 -1.221429

In [47]:
df = pd.DataFrame(np.random.randn(6, 3))

In [48]:
df.iloc[2:, 1] = NA

In [49]:
df.iloc[4:, 2] = NA

In [50]:
df

          0         1         2
0 -1.004416  1.370336 -0.044348
1 -0.304555  0.841187 -1.268892
2  0.350472       NaN -2.528699
3  1.986961       NaN -0.506768
4  0.242760       NaN       NaN
5  0.608739       NaN       NaN

In [51]:
df.fillna(method='ffill')

          0         1         2
0 -1.004416  1.370336 -0.044348
1 -0.304555  0.841187 -1.268892
2  0.350472  0.841187 -2.528699
3  1.986961  0.841187 -0.506768
4  0.242760  0.841187 -0.506768
5  0.608739  0.841187 -0.506768

In [52]:
df.fillna(method='ffill', limit=2)#limit代表向下填充几行

          0         1         2
0 -1.004416  1.370336 -0.044348
1 -0.304555  0.841187 -1.268892
2  0.350472  0.841187 -2.528699
3  1.986961  0.841187 -0.506768
4  0.242760       NaN -0.506768
5  0.608739       NaN -0.506768

In [53]:
df.fillna(method='ffill', limit=3)

          0         1         2
0 -1.004416  1.370336 -0.044348
1 -0.304555  0.841187 -1.268892
2  0.350472  0.841187 -2.528699
3  1.986961  0.841187 -0.506768
4  0.242760  0.841187 -0.506768
5  0.608739       NaN -0.506768

In [54]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [55]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [56]:
df

          0         1         2
0 -1.004416  1.370336 -0.044348
1 -0.304555  0.841187 -1.268892
2  0.350472       NaN -2.528699
3  1.986961       NaN -0.506768
4  0.242760       NaN       NaN
5  0.608739       NaN       NaN

In [59]:
df.fillna(axis=0, method='ffill')

          0         1         2
0 -1.004416  1.370336 -0.044348
1 -0.304555  0.841187 -1.268892
2  0.350472  0.841187 -2.528699
3  1.986961  0.841187 -0.506768
4  0.242760  0.841187 -0.506768
5  0.608739  0.841187 -0.506768

In [62]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
    'k2': [1, 1, 2, 3, 3, 4, 4]})

In [63]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [64]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [65]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [68]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [67]:
data.drop_duplicates(['k1'])#根据一列去除重复项

    k1  k2  v1
0  one   1   0
1  two   1   1

duplicated 和 drop_duplicates 默认保留的是第一个出现的值组合。传入 keep='last'则保留最后一个

In [69]:
data.drop_duplicates(['k2'])

    k1  k2  v1
0  one   1   0
2  one   2   2
3  two   3   3
5  two   4   5

In [78]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork',
                              'bacon','Pastrami','corned beef',
                              'Bacon', 'pastrami', 'honey ham',
                              'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [79]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [72]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [80]:
lowercased = data['food'].str.lower()

In [81]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [82]:
data['animal'] = lowercased.map(meat_to_animal)
'''Series 的 map 方法可以接受一个函数或含有映射关系的字典型对象，
但是这里 有一个小问题，即有些肉类的首字母大写了，而另一些则没有。因此，我们还
需要使用 Series 的 str.lower 方法，将各个值转换为小写:'''

'Series 的 map 方法可以接受一个函数或含有映射关系的字典型对象，\n但是这里 有一个小问题，即有些肉类的首字母大写了，而另一些则没有。因此，我们还\n需要使用 Series 的 str.lower 方法，将各个值转换为小写:'

In [83]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [85]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

使用 map 是一种实现元素级转换以及其他数据清理工作的便捷方式。

In [86]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [87]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [88]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [89]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [90]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [91]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [98]:
 data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                     index=['Ohio', 'Colorado', 'New York'],
                     columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [99]:
transform = lambda x: x[:4].upper()

In [100]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [101]:
data.index = data.index.map(transform)

In [102]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [103]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [104]:
ages = [20, 22, 25, 27, 21, 23, 37, 61, 45, 41, 32]

In [105]:
bins = [18, 25, 35, 60, 100]

In [106]:
cats = pd.cut(ages, bins)

In [107]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (35, 60], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 11
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [108]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 3, 2, 2, 1], dtype=int8)

In [109]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [110]:
pd.value_counts(cats)#pd.value_counts(cats)是 pandas.cut 结果的面元计数。

(18, 25]     5
(35, 60]     3
(25, 35]     2
(60, 100]    1
dtype: int64

In [111]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)#跟“区间”的数学符号一样，
#圆括号表示开端，而方括号则表示闭端(包括)。哪边是闭端可以通过right=False进行修改:

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [36, 61), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 11
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [112]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [114]:
pd.cut(ages, bins, labels=group_names)#通过传递一个列表或数组到 labels，
#设置自己的面元名称

[Youth, Youth, Youth, YoungAdult, Youth, ..., MiddleAged, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 11
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [115]:
data = np.random.rand(20)

In [119]:
pd.cut(data, 4, precision=2)#precision保留小数

[(0.73, 0.98], (0.49, 0.73], (0.49, 0.73], (0.73, 0.98], (0.73, 0.98], ..., (0.0015, 0.25], (0.0015, 0.25], (0.0015, 0.25], (0.25, 0.49], (0.25, 0.49]]
Length: 20
Categories (4, interval[float64]): [(0.0015, 0.25] < (0.25, 0.49] < (0.49, 0.73] < (0.73, 0.98]]

In [120]:
data = np.random.randn(1000)

In [121]:
cats = pd.qcut(data, 4)
#qcut 由于使用的是样本分位数，因此可以得到大小基本相等的面元

In [122]:
cats

[(-0.647, 0.0418], (0.0418, 0.671], (-3.229, -0.647], (0.671, 3.263], (-3.229, -0.647], ..., (-3.229, -0.647], (-0.647, 0.0418], (-3.229, -0.647], (-0.647, 0.0418], (0.0418, 0.671]]
Length: 1000
Categories (4, interval[float64]): [(-3.229, -0.647] < (-0.647, 0.0418] < (0.0418, 0.671] < (0.671, 3.263]]

In [123]:
pd.value_counts(cats)
#每个分段内的个数

(0.671, 3.263]      250
(0.0418, 0.671]     250
(-0.647, 0.0418]    250
(-3.229, -0.647]    250
dtype: int64

In [124]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-1.246, 0.0418], (0.0418, 1.341], (-1.246, 0.0418], (0.0418, 1.341], (-3.229, -1.246], ..., (-3.229, -1.246], (-1.246, 0.0418], (-1.246, 0.0418], (-1.246, 0.0418], (0.0418, 1.341]]
Length: 1000
Categories (4, interval[float64]): [(-3.229, -1.246] < (-1.246, 0.0418] < (0.0418, 1.341] < (1.341, 3.263]]

In [125]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [126]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.005123     0.016561    -0.015243     0.013522
std       0.970114     0.963897     1.003157     1.003947
min      -3.626801    -3.260672    -3.338507    -3.238034
25%      -0.669576    -0.661856    -0.644834    -0.628968
50%      -0.012709     0.008935    -0.019473     0.015881
75%       0.649722     0.707373     0.675286     0.694781
max       2.975449     2.774278     2.937659     2.982386

In [127]:
co1 = data[2]

In [128]:
co1[np.abs(co1) > 3]

57    -3.143071
517   -3.338507
533   -3.068464
Name: 2, dtype: float64

In [138]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
24  -1.497522 -3.260672  0.675766  0.773427
57   2.975449 -0.356765 -3.143071  0.826220
295  0.994145 -0.387775  1.713399 -3.179803
500  1.122333 -0.345827  0.942949 -3.194580
517  0.847164  0.137960 -3.338507 -0.063557
533  1.609384  0.708306 -3.068464  0.125479
655 -1.323871 -0.519180 -0.888803 -3.238034
967 -3.626801 -0.395215  0.089502 -1.758991

In [203]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [205]:
data[np.abs(data) > 3]

      0   1   2   3
0   NaN NaN NaN NaN
1   NaN NaN NaN NaN
2   NaN NaN NaN NaN
3   NaN NaN NaN NaN
4   NaN NaN NaN NaN
5   NaN NaN NaN NaN
6   NaN NaN NaN NaN
7   NaN NaN NaN NaN
8   NaN NaN NaN NaN
9   NaN NaN NaN NaN
10  NaN NaN NaN NaN
11  NaN NaN NaN NaN
12  NaN NaN NaN NaN
13  NaN NaN NaN NaN
14  NaN NaN NaN NaN
15  NaN NaN NaN NaN
16  NaN NaN NaN NaN
17  NaN NaN NaN NaN
18  NaN NaN NaN NaN
19  NaN NaN NaN NaN
20  NaN NaN NaN NaN
21  NaN NaN NaN NaN
22  NaN NaN NaN NaN
23  NaN NaN NaN NaN
24  NaN NaN NaN NaN
25  NaN NaN NaN NaN
26  NaN NaN NaN NaN
27  NaN NaN NaN NaN
28  NaN NaN NaN NaN
29  NaN NaN NaN NaN
..   ..  ..  ..  ..
970 NaN NaN NaN NaN
971 NaN NaN NaN NaN
972 NaN NaN NaN NaN
973 NaN NaN NaN NaN
974 NaN NaN NaN NaN
975 NaN NaN NaN NaN
976 NaN NaN NaN NaN
977 NaN NaN NaN NaN
978 NaN NaN NaN NaN
979 NaN NaN NaN NaN
980 NaN NaN NaN NaN
981 NaN NaN NaN NaN
982 NaN NaN NaN NaN
983 NaN NaN NaN NaN
984 NaN NaN NaN NaN
985 NaN NaN NaN NaN
986 NaN NaN NaN NaN
987 NaN NaN NaN NaN
988 NaN NaN NaN NaN
989 NaN NaN NaN NaN
990 NaN NaN NaN NaN
991 NaN NaN NaN NaN
992 NaN NaN NaN NaN
993 NaN NaN NaN NaN
994 NaN NaN NaN NaN
995 NaN NaN NaN NaN
996 NaN NaN NaN NaN
997 NaN NaN NaN NaN
998 NaN NaN NaN NaN
999 NaN NaN NaN NaN

[1000 rows x 4 columns]

In [206]:
np.sign(data) * 3

       0    1    2    3
0   -3.0  3.0  3.0 -3.0
1   -3.0  3.0 -3.0  3.0
2   -3.0  3.0 -3.0 -3.0
3   -3.0 -3.0 -3.0 -3.0
4    3.0 -3.0 -3.0  3.0
5    3.0  3.0 -3.0  3.0
6    3.0 -3.0  3.0 -3.0
7   -3.0 -3.0 -3.0 -3.0
8    3.0  3.0 -3.0  3.0
9    3.0  3.0  3.0  3.0
10  -3.0 -3.0 -3.0 -3.0
11  -3.0 -3.0 -3.0 -3.0
12   3.0  3.0  3.0  3.0
13  -3.0 -3.0 -3.0  3.0
14   3.0  3.0 -3.0  3.0
15   3.0 -3.0  3.0 -3.0
16   3.0  3.0  3.0 -3.0
17   3.0  3.0  3.0  3.0
18  -3.0 -3.0  3.0  3.0
19   3.0 -3.0 -3.0 -3.0
20  -3.0  3.0  3.0 -3.0
21   3.0  3.0  3.0 -3.0
22  -3.0 -3.0 -3.0 -3.0
23   3.0  3.0  3.0  3.0
24  -3.0 -3.0  3.0  3.0
25  -3.0 -3.0  3.0  3.0
26   3.0  3.0 -3.0  3.0
27   3.0 -3.0 -3.0  3.0
28   3.0 -3.0 -3.0 -3.0
29  -3.0 -3.0  3.0  3.0
..   ...  ...  ...  ...
970  3.0 -3.0 -3.0 -3.0
971 -3.0 -3.0  3.0  3.0
972  3.0 -3.0  3.0  3.0
973 -3.0  3.0  3.0  3.0
974  3.0 -3.0 -3.0 -3.0
975  3.0 -3.0  3.0 -3.0
976  3.0  3.0 -3.0 -3.0
977  3.0 -3.0 -3.0 -3.0
978 -3.0  3.0  3.0 -3.0
979 -3.0 -3.0  3.0  3.0
980  3.0 -3.0 -3.0 -3.0
981 -3.0 -3.0  3.0  3.0
982 -3.0 -3.0 -3.0  3.0
983  3.0 -3.0 -3.0 -3.0
984  3.0  3.0  3.0  3.0
985  3.0  3.0  3.0 -3.0
986  3.0  3.0 -3.0  3.0
987  3.0  3.0  3.0 -3.0
988 -3.0 -3.0 -3.0  3.0
989 -3.0 -3.0 -3.0  3.0
990  3.0  3.0 -3.0 -3.0
991  3.0  3.0  3.0  3.0
992 -3.0 -3.0  3.0  3.0
993 -3.0 -3.0  3.0  3.0
994 -3.0  3.0  3.0 -3.0
995 -3.0  3.0 -3.0 -3.0
996 -3.0  3.0 -3.0 -3.0
997  3.0  3.0  3.0  3.0
998  3.0  3.0  3.0 -3.0
999 -3.0  3.0 -3.0  3.0

[1000 rows x 4 columns]

In [207]:
data

            0         1         2         3
0   -0.541830  0.829702  0.144814 -0.968072
1   -0.110639  0.561348 -0.462719  0.329727
2   -0.395857  1.422001 -0.522859 -0.222272
3   -0.293313 -0.377793 -0.998117 -0.353839
4    0.282402 -0.039912 -0.926741  1.574757
5    0.263603  1.522223 -0.805801  0.280804
6    1.191845 -0.846429  0.772077 -0.128456
7   -0.630414 -1.791366 -1.705401 -0.134441
8    1.182104  1.089340 -0.196510  0.470832
9    1.617028  0.603256  0.018492  1.872745
10  -0.371201 -1.151394 -1.371992 -0.267503
11  -1.331448 -1.081154 -0.157917 -0.265074
12   1.078344  0.370663  0.344645  0.243539
13  -1.919105 -0.166551 -0.963368  0.555328
14   0.373385  0.864162 -0.089011  1.022117
15   0.545078 -0.706001  0.324415 -1.157214
16   0.764686  1.133096  0.574528 -0.352912
17   0.250955  0.476921  0.366510  0.271048
18  -0.344208 -0.381199  0.145309  0.439839
19   0.594044 -0.390267 -0.362048 -0.795363
20  -1.387240  1.319649  0.578217 -0.125518
21   0.295463  0.157584  1.435120 -1.760600
22  -0.038506 -2.125445 -0.187626 -1.241533
23   1.949945  1.253428  0.892667  0.191869
24  -1.497522 -3.000000  0.675766  0.773427
25  -1.873368 -0.964158  0.273209  0.117954
26   0.090828  0.913078 -0.447202  0.597709
27   0.900405 -0.060993 -0.349319  1.698761
28   0.017534 -0.516239 -0.971133 -0.534036
29  -0.395252 -0.744074  0.311212  0.631216
..        ...       ...       ...       ...
970  0.464008 -1.793312 -0.071909 -0.671788
971 -0.946639 -0.590662  0.518782  0.083263
972  0.717365 -0.397357  1.177601  0.005434
973 -1.135855  0.135093  0.830654  0.494470
974  1.804681 -0.637382 -1.125171 -0.276712
975  1.090334 -1.693426  2.665493 -0.283342
976  1.594739  0.573389 -1.589574 -1.165942
977  0.812921 -1.051369 -1.133702 -0.063329
978 -0.470284  0.674309  0.318143 -1.136936
979 -0.428938 -2.531770  1.411520  1.091522
980  1.247766 -0.980438 -1.870044 -2.247951
981 -0.350256 -1.472462  0.911056  0.280270
982 -0.906561 -0.528851 -1.655986  2.091119
983  0.860391 -0.720422 -0.003044 -0.567603
984  0.281310  0.798606  0.183835  1.108426
985  0.277666  0.723587  0.049577 -0.688366
986  0.774500  0.401969 -2.493896  1.050552
987  0.743754  0.670426  1.557150 -0.888841
988 -0.053937 -0.853032 -0.844721  1.044443
989 -0.790461 -0.814452 -0.023536  0.933091
990  0.067993  0.004620 -0.020881 -0.395801
991  0.147835  1.583380  0.389847  1.080852
992 -2.269256 -0.267797  1.316818  0.945018
993 -0.179973 -0.741529  1.245465  1.281099
994 -0.829036  2.252737  1.038436 -0.447181
995 -0.537106  0.616465 -1.071938 -2.574667
996 -0.458803  0.153851 -1.145469 -0.089800
997  0.460485  1.118377  1.058149  0.488588
998  0.011365  0.196499  0.975185 -0.665240
999 -0.013794  1.894203 -1.194084  1.683325

[1000 rows x 4 columns]

In [141]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.005750     0.016821    -0.014692     0.014134
std       0.967965     0.963044     1.001448     1.002041
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.669576    -0.661856    -0.644834    -0.628968
50%      -0.012709     0.008935    -0.019473     0.015881
75%       0.649722     0.707373     0.675286     0.694781
max       2.975449     2.774278     2.937659     2.982386

In [143]:
np.sign(data).head()#根据数据的值是正还是负，np.sign(data)可以生成 1和-1

     0    1    2    3
0 -1.0  1.0  1.0 -1.0
1 -1.0  1.0 -1.0  1.0
2 -1.0  1.0 -1.0 -1.0
3 -1.0 -1.0 -1.0 -1.0
4  1.0 -1.0 -1.0  1.0

In [144]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [154]:
sampler = np.random.permutation(5)
#通过需要排列的轴的长度调用 permutation，可产生一个表示新顺序的整数数组

In [155]:
sampler

array([2, 4, 3, 1, 0])

In [147]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [156]:
df.take(sampler)

    0   1   2   3
2   8   9  10  11
4  16  17  18  19
3  12  13  14  15
1   4   5   6   7
0   0   1   2   3

In [159]:
df.sample(n=3)#随机选取n行

    0   1   2   3
2   8   9  10  11
0   0   1   2   3
4  16  17  18  19

In [160]:
choices = pd.Series([5, 7, -1, 6, 4])

In [161]:
draws = choices.sample(n=10, replace=True)
#要通过替换的方式产生样本(允许重复选择)，可以传递 replace=True 到 sample

In [162]:
draws

2   -1
2   -1
3    6
0    5
3    6
0    5
3    6
1    7
3    6
0    5
dtype: int64

In [163]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})

In [166]:
'''如果 DataFrame 的某一列中含有 k 个不同的值，则可以派生出一个 k 列矩阵或 
DataFrame(其值全为 1 和 0)。pandas 有一个 get_dummies 函数可以实现该功
能(其实自己动手做一个也不难)'''
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [167]:
'''有时候，你可能想给指标 DataFrame 的列加上一个前缀，以便能够跟其他数据 
进行合并。get_dummies 的 prefix 参数可以实现该功能:'''

'有时候，你可能想给指标 DataFrame 的列加上一个前缀，以便能够跟其他数据 \n进行合并。get_dummies 的 prefix 参数可以实现该功能:'

In [168]:
dummies = pd.get_dummies(df['key'], prefix='key')

In [170]:
df_with_dummy = df[['data1']].join(dummies)

In [171]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [172]:
mnames = ['movie_id', 'title', 'genres']

In [174]:
movies = pd.read_table('/Users/frankfwu/Documents/pydata-book-2nd-edition/datasets/movielens/movies.dat',
                       sep='::', header=None, names=mnames)

/Users/frankfwu/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.

In [175]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [176]:
all_genres = []

In [177]:
for x in movies.genres:
    all_genres.extend(x.split('|'))

In [178]:
genres = pd.unique(all_genres)

In [179]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [180]:
zero_matrix = np.zeros((len(movies), len(genres)))

In [181]:
dummies = pd.DataFrame(zero_matrix, columns=genres)

In [182]:
gen = movies.genres[0]

In [183]:
gen.split('|')

['Animation', "Children's", 'Comedy']

In [184]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2])

In [185]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [186]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))

In [187]:
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Adventure                                0
Genre_Fantasy                                  0
Genre_Romance                                  0
Genre_Drama                                    0
Genre_Action                                   0
Genre_Crime                                    0
Genre_Thriller                                 0
Genre_Horror                                   0
Genre_Sci-Fi                                   0
Genre_Documentary                              0
Genre_War                                      0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Film-Noir                                0
Genre_Western                                  0
Name: 0, dtype: object

In [188]:
zero_matrix

array([[1., 1., 1., ..., 0., 0., 0.],
       [0., 1., 0., ..., 0., 0., 0.],
       [0., 0., 1., ..., 0., 0., 0.],
       ...,
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.]])

In [189]:
va1 = 'a,b,  guido'

In [190]:
va1.split(',')

['a', 'b', '  guido']

In [191]:
pieces = [x.strip() for x in va1.split(',')]

In [192]:
pieces

['a', 'b', 'guido']

In [193]:
0 * np.nan
np.nan == np.nan
np.inf > np.nan
np.nan - np.nan
np.nan in set([np.nan])
0.3 == 3 * 0.1

False

In [194]:
0*np.nan

nan

In [195]:
np.nan == np.nan

False

In [196]:
np.inf > np.nan

False

In [197]:
np.nan - np.nan

nan

In [198]:
np.nan in set([np.nan])

True

In [199]:
0.3 == 3*0.1

False

In [200]:
np.array(0) / np.array(0)
np.array(0) // np.array(0)
np.array([np.nan]).astype(int).astype(float)

/Users/frankfwu/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: RuntimeWarning: invalid value encountered in true_divide
  """Entry point for launching an IPython kernel.
/Users/frankfwu/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: RuntimeWarning: divide by zero encountered in floor_divide

array([-9.22337204e+18])

In [201]:
np.array([np.nan]).astype(int).astype(float)

array([-9.22337204e+18])

In [208]:
first, second, third = pieces

In [209]:
first + '::' + second + '::' + third

'a::b::guido'

In [210]:
'::'.join(pieces)

'a::b::guido'

In [212]:
'guido' in va1

True

In [213]:
va1.index(',')

1

In [214]:
va1.find(':')

-1

In [215]:
va1.count(',')

2

In [216]:
va1.replace(',', '')

'ab  guido'

In [217]:
import re

In [218]:
text = "foo    bar\t baz  \tqux"

In [219]:
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [220]:
regex = re.compile('\s+')

In [221]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [223]:
regex.findall(text)

['    ', '\t ', '  \t']

In [224]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""

In [225]:
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [226]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [227]:
 regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [228]:
m = regex.search(text)

In [229]:
m

In [230]:
text[m.start():m.end()]

'dave@google.com'

In [231]:
print(regex.match(text))

None

In [232]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [233]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [234]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [235]:
m = regex.match('wesm@bright.net')

In [236]:
m.groups()

('wesm', 'bright', 'net')

In [237]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [238]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

In [239]:
data = {'Dave': 'dave@google.com', 'Steve':
        'steve@gmail.com','Rob': 'rob@gmail.com', 'Wes': np.nan}

In [240]:
data = pd.Series(data)

In [241]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [242]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [243]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [244]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [245]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [246]:
matches = data.str.match(pattern, flags=re.IGNORECASE)

In [247]:
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [248]:
matches.str.get(1)

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [249]:
matches.str[0]

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [250]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object